<template>
  <section class="questions">
    <div class='container'>
      <h2 class="projects__title  my-title">Часто задаваемые вопросы</h2>
      <v-expansion-panels
        :popout="true"
        :multiple="true"
        :hover="true">
        <v-expansion-panel
          v-for="(question,i) in questions"
          :key="i"
        >
          <v-expansion-panel-header>{{question.title}}</v-expansion-panel-header>
          <v-expansion-panel-content>
            {{question.description}}
          </v-expansion-panel-content>
        </v-expansion-panel>
      </v-expansion-panels>
    </div>
  </section>
</template>

<script>
  export default {
    data() {
      return {
        questions: [
          {
            title: 'Что сначала, делать потолки или клеить обои?',
            description: 'Сначала делают потолки, чтобы не запылить и не испачкать обои.'
          },
          {
            title: 'Имеют ли натяжные потолки запах?',
            description: 'Сами потолки запаха не имеют, но после монтажа может остаться запах газолина от тепловой пушки, который полностью исчезает после проветривания.'
          },
          {
            title: 'Какие у вас гарантии?',
            description: 'Мы даем 10 лет гарантии на полотна и 2 года на светильники, комплектующие и все виды работ!'
          },
          {
            title: 'На сколько см опустится натяжной потолок?',
            description: 'В среднем новый потолк опустится на 4 см от самой нижней точки старого потолка. Но, учитывая что он будет идеально ровный, визуально потолок будет казаться выше.'
          },
          {
            title: 'Какой срок службы натяжных потолков?',
            description: 'Срок годности у натяжных потолков не ограничен. При должном уходе и бережном отношении, натяжной потолок порадует Вас на очень долгое время.'
          },
          {
            title: 'Сколько по времени длится установка натяжного потолка?',
            description: 'Время установки натяжного потолка зависит от некоторых факторов, а именно: площади, наличия дополнительных углов, количества  точек света, шторных багетов. В среднем, длительность монтажа натяжного  потолока, площадью в 15кв.м и с установкой одной люстры займёт 2 часа.'
          },
          {
            title: 'У вас бесшовные натяжные потолки?',
            description: 'Шовность потолков может быть в следующих случаях: если ширина помещения больше 6 метров, либо это декоративный шов - спайка, которая позволяет интересно обыграть дизайн потолка, избегая более сложных конструкций до нескольких уровней на натяжном потолке.'
          },
          {
            title: 'Как ухаживать за натяжными потолками?',
            description: 'Натяжные потолки неприхотливы в уходе, если используются не абразивные средства. Подойдёт и жидкость для мытья посуды и мягкая губка. Но лучше, если будут использоваться специализированные средства для ухода за натяжным потолком. '
          },
        ]
      }
    }
  }
</script>

<style scoped>
  .container {
    max-width: 1370px;
    margin: 0 auto;
    width: 100%;
  }
</style>
